hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_eui_regs.h
/*
 * Copyright (c) 2021-2026 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_EUI_H
#define HPM_EUI_H

typedef struct {
    __RW uint32_t CTRL;                        /* 0x0: Control Register */
    __RW uint32_t DIV_CFG;                     /* 0x4:  */
    __RW uint32_t PAD_CFG;                     /* 0x8:  */
    __RW uint32_t POL_CFG;                     /* 0xC:  */
    __RW uint32_t OUT_CFG;                     /* 0x10:  */
    __RW uint32_t IN_CFG;                      /* 0x14:  */
    __R  uint8_t  RESERVED0[8];                /* 0x18 - 0x1F: Reserved */
    __W  uint32_t IRQ_STS;                     /* 0x20:  */
    __RW uint32_t IRQ_EN;                      /* 0x24:  */
    __R  uint8_t  RESERVED1[24];               /* 0x28 - 0x3F: Reserved */
    __R  uint32_t DATA_IN0;                    /* 0x40:  */
    __R  uint32_t DATA_IN1;                    /* 0x44:  */
    __R  uint32_t DATA_IN2;                    /* 0x48:  */
    __R  uint32_t DATA_IN3;                    /* 0x4C:  */
    __R  uint32_t DATA_IN4;                    /* 0x50:  */
    __R  uint32_t DATA_IN5;                    /* 0x54:  */
    __R  uint32_t DATA_IN6;                    /* 0x58:  */
    __R  uint32_t DATA_IN7;                    /* 0x5C:  */
    __R  uint8_t  RESERVED2[32];               /* 0x60 - 0x7F: Reserved */
    __RW uint32_t DAB_CTRL;                    /* 0x80:  */
    __R  uint8_t  RESERVED3[12];               /* 0x84 - 0x8F: Reserved */
    __RW uint32_t DCD_CTRL;                    /* 0x90:  */
    __R  uint8_t  RESERVED4[12];               /* 0x94 - 0x9F: Reserved */
    __RW uint32_t DEF_CTRL;                    /* 0xA0:  */
    __R  uint8_t  RESERVED5[12];               /* 0xA4 - 0xAF: Reserved */
    __RW uint32_t DGH_CTRL;                    /* 0xB0:  */
    __R  uint8_t  RESERVED6[76];               /* 0xB4 - 0xFF: Reserved */
    __RW uint32_t DA_00;                       /* 0x100:  */
    __RW uint32_t DA_01;                       /* 0x104:  */
    __R  uint8_t  RESERVED7[56];               /* 0x108 - 0x13F: Reserved */
    __RW uint32_t DB_00;                       /* 0x140:  */
    __RW uint32_t DB_01;                       /* 0x144:  */
    __R  uint8_t  RESERVED8[56];               /* 0x148 - 0x17F: Reserved */
    __RW uint32_t DC_00;                       /* 0x180:  */
    __RW uint32_t DC_01;                       /* 0x184:  */
    __R  uint8_t  RESERVED9[56];               /* 0x188 - 0x1BF: Reserved */
    __RW uint32_t DD_00;                       /* 0x1C0:  */
    __RW uint32_t DD_01;                       /* 0x1C4:  */
    __R  uint8_t  RESERVED10[56];              /* 0x1C8 - 0x1FF: Reserved */
    __RW uint32_t DE_00;                       /* 0x200:  */
    __RW uint32_t DE_01;                       /* 0x204:  */
    __R  uint8_t  RESERVED11[56];              /* 0x208 - 0x23F: Reserved */
    __RW uint32_t DF_00;                       /* 0x240:  */
    __RW uint32_t DF_01;                       /* 0x244:  */
    __R  uint8_t  RESERVED12[56];              /* 0x248 - 0x27F: Reserved */
    __RW uint32_t DG_00;                       /* 0x280:  */
    __RW uint32_t DG_01;                       /* 0x284:  */
    __R  uint8_t  RESERVED13[56];              /* 0x288 - 0x2BF: Reserved */
    __RW uint32_t DH_00;                       /* 0x2C0:  */
    __RW uint32_t DH_01;                       /* 0x2C4:  */
} EUI_Type;


/* Bitfield definition for register: CTRL */
/*
 * CLR_OUTPUT (RW)
 *
 * write 1 to send 24bit 0 to data output, Auto clear after clear finishd;
 * only can be set when clock_enable(in eut_state)  is 0
 */
#define EUI_CTRL_CLR_OUTPUT_MASK (0x80000000UL)
#define EUI_CTRL_CLR_OUTPUT_SHIFT (31U)
#define EUI_CTRL_CLR_OUTPUT_SET(x) (((uint32_t)(x) << EUI_CTRL_CLR_OUTPUT_SHIFT) & EUI_CTRL_CLR_OUTPUT_MASK)
#define EUI_CTRL_CLR_OUTPUT_GET(x) (((uint32_t)(x) & EUI_CTRL_CLR_OUTPUT_MASK) >> EUI_CTRL_CLR_OUTPUT_SHIFT)

/*
 * CLR_DATA_IN (WO)
 *
 * write 1 to clear data_in register to all 0.
 * only can be set when clock_enable(in eut_state)  is 0
 */
#define EUI_CTRL_CLR_DATA_IN_MASK (0x40000000UL)
#define EUI_CTRL_CLR_DATA_IN_SHIFT (30U)
#define EUI_CTRL_CLR_DATA_IN_SET(x) (((uint32_t)(x) << EUI_CTRL_CLR_DATA_IN_SHIFT) & EUI_CTRL_CLR_DATA_IN_MASK)
#define EUI_CTRL_CLR_DATA_IN_GET(x) (((uint32_t)(x) & EUI_CTRL_CLR_DATA_IN_MASK) >> EUI_CTRL_CLR_DATA_IN_SHIFT)

/*
 * COL_LOOP_MODE (RW)
 *
 * 0:  all configured LED on at same time in one column;
 * 1:  only one LED on in one column, need
 */
#define EUI_CTRL_COL_LOOP_MODE_MASK (0x4U)
#define EUI_CTRL_COL_LOOP_MODE_SHIFT (2U)
#define EUI_CTRL_COL_LOOP_MODE_SET(x) (((uint32_t)(x) << EUI_CTRL_COL_LOOP_MODE_SHIFT) & EUI_CTRL_COL_LOOP_MODE_MASK)
#define EUI_CTRL_COL_LOOP_MODE_GET(x) (((uint32_t)(x) & EUI_CTRL_COL_LOOP_MODE_MASK) >> EUI_CTRL_COL_LOOP_MODE_SHIFT)

/*
 * DISP_MODE (RW)
 *
 * 0 for 8x8(8bit data,8bit select, need 2 external 595 chip, 1 for data, 1 for select)
 * 1 for 16x4(16bit data, 4bit select, need 3 external 595 chip, 2 for data, 4bit for select,
 * the other 4bit  can be used as dedicate led control)
 */
#define EUI_CTRL_DISP_MODE_MASK (0x2U)
#define EUI_CTRL_DISP_MODE_SHIFT (1U)
#define EUI_CTRL_DISP_MODE_SET(x) (((uint32_t)(x) << EUI_CTRL_DISP_MODE_SHIFT) & EUI_CTRL_DISP_MODE_MASK)
#define EUI_CTRL_DISP_MODE_GET(x) (((uint32_t)(x) & EUI_CTRL_DISP_MODE_MASK) >> EUI_CTRL_DISP_MODE_SHIFT)

/*
 * ENABLE (RW)
 *
 * set to start block; clr to stop(hw will finish current loop)
 */
#define EUI_CTRL_ENABLE_MASK (0x1U)
#define EUI_CTRL_ENABLE_SHIFT (0U)
#define EUI_CTRL_ENABLE_SET(x) (((uint32_t)(x) << EUI_CTRL_ENABLE_SHIFT) & EUI_CTRL_ENABLE_MASK)
#define EUI_CTRL_ENABLE_GET(x) (((uint32_t)(x) & EUI_CTRL_ENABLE_MASK) >> EUI_CTRL_ENABLE_SHIFT)

/* Bitfield definition for register: DIV_CFG */
/*
 * CLKO_ADJ (RW)
 *
 * used to generate pulse signal for  internal slow clock base, such as data change time.
 * default 2 for data change 3 system clock cycles after negedge of coutput clock
 */
#define EUI_DIV_CFG_CLKO_ADJ_MASK (0xF00000UL)
#define EUI_DIV_CFG_CLKO_ADJ_SHIFT (20U)
#define EUI_DIV_CFG_CLKO_ADJ_SET(x) (((uint32_t)(x) << EUI_DIV_CFG_CLKO_ADJ_SHIFT) & EUI_DIV_CFG_CLKO_ADJ_MASK)
#define EUI_DIV_CFG_CLKO_ADJ_GET(x) (((uint32_t)(x) & EUI_DIV_CFG_CLKO_ADJ_MASK) >> EUI_DIV_CFG_CLKO_ADJ_SHIFT)

