hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_eui_regs.h
/*
 * HOLD_TIME (RW)
 *
 * for display hold time, in unit of slot time(32 output clock cycles)
 * shift 16 or 24 cycles in one slot time, then hold output for hold_time slots
 * it need N*(hold_time+1) slot to display all LEDs, N is LED column select signal bits,
 * valid value is 1 to 8 (default is 1024us in 8x8 mode, 512 us in 16x4 mode)
 */
#define EUI_DIV_CFG_HOLD_TIME_MASK (0xF0000UL)
#define EUI_DIV_CFG_HOLD_TIME_SHIFT (16U)
#define EUI_DIV_CFG_HOLD_TIME_SET(x) (((uint32_t)(x) << EUI_DIV_CFG_HOLD_TIME_SHIFT) & EUI_DIV_CFG_HOLD_TIME_MASK)
#define EUI_DIV_CFG_HOLD_TIME_GET(x) (((uint32_t)(x) & EUI_DIV_CFG_HOLD_TIME_MASK) >> EUI_DIV_CFG_HOLD_TIME_SHIFT)

/*
 * CLK_DIV (RW)
 *
 * output clock divider of system clock.
 * 0 for div2, 1 for div4;  default 0x63 for 1MHz output clock at 200MHz system clock
 */
#define EUI_DIV_CFG_CLK_DIV_MASK (0xFFFFU)
#define EUI_DIV_CFG_CLK_DIV_SHIFT (0U)
#define EUI_DIV_CFG_CLK_DIV_SET(x) (((uint32_t)(x) << EUI_DIV_CFG_CLK_DIV_SHIFT) & EUI_DIV_CFG_CLK_DIV_MASK)
#define EUI_DIV_CFG_CLK_DIV_GET(x) (((uint32_t)(x) & EUI_DIV_CFG_CLK_DIV_MASK) >> EUI_DIV_CFG_CLK_DIV_SHIFT)

/* Bitfield definition for register: PAD_CFG */
/*
 * FILT_LEN (RW)
 *
 * switch filter length, use to remove jitter. In unit of disp_time.
 * will assert interrupt if scan input data stable for more than this time.
 * Default 5ms in 8x8 mode
 */
#define EUI_PAD_CFG_FILT_LEN_MASK (0xFFFU)
#define EUI_PAD_CFG_FILT_LEN_SHIFT (0U)
#define EUI_PAD_CFG_FILT_LEN_SET(x) (((uint32_t)(x) << EUI_PAD_CFG_FILT_LEN_SHIFT) & EUI_PAD_CFG_FILT_LEN_MASK)
#define EUI_PAD_CFG_FILT_LEN_GET(x) (((uint32_t)(x) & EUI_PAD_CFG_FILT_LEN_MASK) >> EUI_PAD_CFG_FILT_LEN_SHIFT)

/* Bitfield definition for register: POL_CFG */
/*
 * DI_POL (RW)
 *
 * polarity at pad_do_eut_in
 */
#define EUI_POL_CFG_DI_POL_MASK (0x8000000UL)
#define EUI_POL_CFG_DI_POL_SHIFT (27U)
#define EUI_POL_CFG_DI_POL_SET(x) (((uint32_t)(x) << EUI_POL_CFG_DI_POL_SHIFT) & EUI_POL_CFG_DI_POL_MASK)
#define EUI_POL_CFG_DI_POL_GET(x) (((uint32_t)(x) & EUI_POL_CFG_DI_POL_MASK) >> EUI_POL_CFG_DI_POL_SHIFT)

/*
 * DO_POL (RW)
 *
 * polarity at pad_do_eut_out
 */
#define EUI_POL_CFG_DO_POL_MASK (0x4000000UL)
#define EUI_POL_CFG_DO_POL_SHIFT (26U)
#define EUI_POL_CFG_DO_POL_SET(x) (((uint32_t)(x) << EUI_POL_CFG_DO_POL_SHIFT) & EUI_POL_CFG_DO_POL_MASK)
#define EUI_POL_CFG_DO_POL_GET(x) (((uint32_t)(x) & EUI_POL_CFG_DO_POL_MASK) >> EUI_POL_CFG_DO_POL_SHIFT)

/*
 * CK_POL (RW)
 *
 * polarity at pad_do_eut_ck
 */
#define EUI_POL_CFG_CK_POL_MASK (0x2000000UL)
#define EUI_POL_CFG_CK_POL_SHIFT (25U)
#define EUI_POL_CFG_CK_POL_SET(x) (((uint32_t)(x) << EUI_POL_CFG_CK_POL_SHIFT) & EUI_POL_CFG_CK_POL_MASK)
#define EUI_POL_CFG_CK_POL_GET(x) (((uint32_t)(x) & EUI_POL_CFG_CK_POL_MASK) >> EUI_POL_CFG_CK_POL_SHIFT)

/*
 * SH_POL (RW)
 *
 * polarity at pad_do_eut_sh
 */
#define EUI_POL_CFG_SH_POL_MASK (0x1000000UL)
#define EUI_POL_CFG_SH_POL_SHIFT (24U)
#define EUI_POL_CFG_SH_POL_SET(x) (((uint32_t)(x) << EUI_POL_CFG_SH_POL_SHIFT) & EUI_POL_CFG_SH_POL_MASK)
#define EUI_POL_CFG_SH_POL_GET(x) (((uint32_t)(x) & EUI_POL_CFG_SH_POL_MASK) >> EUI_POL_CFG_SH_POL_SHIFT)

/*
 * DATA_POL (RW)
 *
 * output polarity, set to invert output data at output shift register.
 * NOTE: high 16bits are used in 8x8 mode since shift is always 24 cycles
 */
#define EUI_POL_CFG_DATA_POL_MASK (0xFFFFFFUL)
#define EUI_POL_CFG_DATA_POL_SHIFT (0U)
#define EUI_POL_CFG_DATA_POL_SET(x) (((uint32_t)(x) << EUI_POL_CFG_DATA_POL_SHIFT) & EUI_POL_CFG_DATA_POL_MASK)
#define EUI_POL_CFG_DATA_POL_GET(x) (((uint32_t)(x) & EUI_POL_CFG_DATA_POL_MASK) >> EUI_POL_CFG_DATA_POL_SHIFT)

/* Bitfield definition for register: OUT_CFG */
/*
 * DO_CFG (RW)
 *
 * define how many dedicate led controls
 * in 8x8 mode:
 * 0:  no dedicate led control, use 8bits(A~H) for led line select
 * 1: do_val[7]/H is use as dedicate led control, 7bits(A~G) for led line select
 * 2: do_val[7:6]/GH are use as dedicate led control, 6bits(A~F) for led line select
 * …...
 * 6: do_val[7:2]/C~H are use as dedicate led control, 2bit/AB for led line select
 * 7:  24 bits  are used as dedicate led control(do_val[23:0] is used)
 * in 16x4 mode, if set to 0~4, 4bit(A~D)for led line select
 * others are same as 8x8 mode
 */
#define EUI_OUT_CFG_DO_CFG_MASK (0x7000000UL)
#define EUI_OUT_CFG_DO_CFG_SHIFT (24U)
#define EUI_OUT_CFG_DO_CFG_SET(x) (((uint32_t)(x) << EUI_OUT_CFG_DO_CFG_SHIFT) & EUI_OUT_CFG_DO_CFG_MASK)
#define EUI_OUT_CFG_DO_CFG_GET(x) (((uint32_t)(x) & EUI_OUT_CFG_DO_CFG_MASK) >> EUI_OUT_CFG_DO_CFG_SHIFT)

/*
 * DO_VAL (RW)
 *
 * dedicate led control values, this value will override output data(after do_pol)
 */
#define EUI_OUT_CFG_DO_VAL_MASK (0xFFFFFFUL)
#define EUI_OUT_CFG_DO_VAL_SHIFT (0U)
#define EUI_OUT_CFG_DO_VAL_SET(x) (((uint32_t)(x) << EUI_OUT_CFG_DO_VAL_SHIFT) & EUI_OUT_CFG_DO_VAL_MASK)
#define EUI_OUT_CFG_DO_VAL_GET(x) (((uint32_t)(x) & EUI_OUT_CFG_DO_VAL_MASK) >> EUI_OUT_CFG_DO_VAL_SHIFT)

/* Bitfield definition for register: IN_CFG */
/*
 * DI_CFG (RW)
 *
 * set for input used as dedicate switch, will use dedicate filter logic and interrupt logic
 */
#define EUI_IN_CFG_DI_CFG_MASK (0xFFFF0000UL)
#define EUI_IN_CFG_DI_CFG_SHIFT (16U)
#define EUI_IN_CFG_DI_CFG_SET(x) (((uint32_t)(x) << EUI_IN_CFG_DI_CFG_SHIFT) & EUI_IN_CFG_DI_CFG_MASK)
#define EUI_IN_CFG_DI_CFG_GET(x) (((uint32_t)(x) & EUI_IN_CFG_DI_CFG_MASK) >> EUI_IN_CFG_DI_CFG_SHIFT)

/*
 * DI_VAL (RO)
 *
 * 16bit input data
 */
#define EUI_IN_CFG_DI_VAL_MASK (0xFFFFU)
#define EUI_IN_CFG_DI_VAL_SHIFT (0U)
#define EUI_IN_CFG_DI_VAL_GET(x) (((uint32_t)(x) & EUI_IN_CFG_DI_VAL_MASK) >> EUI_IN_CFG_DI_VAL_SHIFT)

/* Bitfield definition for register: IRQ_STS */
/*
 * IRQ_SINGLE_STS (W1C)
 *
 */
#define EUI_IRQ_STS_IRQ_SINGLE_STS_MASK (0x2U)
#define EUI_IRQ_STS_IRQ_SINGLE_STS_SHIFT (1U)
#define EUI_IRQ_STS_IRQ_SINGLE_STS_SET(x) (((uint32_t)(x) << EUI_IRQ_STS_IRQ_SINGLE_STS_SHIFT) & EUI_IRQ_STS_IRQ_SINGLE_STS_MASK)
#define EUI_IRQ_STS_IRQ_SINGLE_STS_GET(x) (((uint32_t)(x) & EUI_IRQ_STS_IRQ_SINGLE_STS_MASK) >> EUI_IRQ_STS_IRQ_SINGLE_STS_SHIFT)

