hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_eui_regs.h
/*
 * IRQ_AREA_STS (W1C)
 *
 */
#define EUI_IRQ_STS_IRQ_AREA_STS_MASK (0x1U)
#define EUI_IRQ_STS_IRQ_AREA_STS_SHIFT (0U)
#define EUI_IRQ_STS_IRQ_AREA_STS_SET(x) (((uint32_t)(x) << EUI_IRQ_STS_IRQ_AREA_STS_SHIFT) & EUI_IRQ_STS_IRQ_AREA_STS_MASK)
#define EUI_IRQ_STS_IRQ_AREA_STS_GET(x) (((uint32_t)(x) & EUI_IRQ_STS_IRQ_AREA_STS_MASK) >> EUI_IRQ_STS_IRQ_AREA_STS_SHIFT)

/* Bitfield definition for register: IRQ_EN */
/*
 * IRQ_SINGLE_EN (RW)
 *
 */
#define EUI_IRQ_EN_IRQ_SINGLE_EN_MASK (0x2U)
#define EUI_IRQ_EN_IRQ_SINGLE_EN_SHIFT (1U)
#define EUI_IRQ_EN_IRQ_SINGLE_EN_SET(x) (((uint32_t)(x) << EUI_IRQ_EN_IRQ_SINGLE_EN_SHIFT) & EUI_IRQ_EN_IRQ_SINGLE_EN_MASK)
#define EUI_IRQ_EN_IRQ_SINGLE_EN_GET(x) (((uint32_t)(x) & EUI_IRQ_EN_IRQ_SINGLE_EN_MASK) >> EUI_IRQ_EN_IRQ_SINGLE_EN_SHIFT)

/*
 * IRQ_AREA_EN (RW)
 *
 */
#define EUI_IRQ_EN_IRQ_AREA_EN_MASK (0x1U)
#define EUI_IRQ_EN_IRQ_AREA_EN_SHIFT (0U)
#define EUI_IRQ_EN_IRQ_AREA_EN_SET(x) (((uint32_t)(x) << EUI_IRQ_EN_IRQ_AREA_EN_SHIFT) & EUI_IRQ_EN_IRQ_AREA_EN_MASK)
#define EUI_IRQ_EN_IRQ_AREA_EN_GET(x) (((uint32_t)(x) & EUI_IRQ_EN_IRQ_AREA_EN_MASK) >> EUI_IRQ_EN_IRQ_AREA_EN_SHIFT)

/* Bitfield definition for register: DATA_IN0 */
/*
 * DATA (RO)
 *
 * read value when select bit 0(0x01 for output value in 8x8 mode)
 */
#define EUI_DATA_IN0_DATA_MASK (0xFFFFU)
#define EUI_DATA_IN0_DATA_SHIFT (0U)
#define EUI_DATA_IN0_DATA_GET(x) (((uint32_t)(x) & EUI_DATA_IN0_DATA_MASK) >> EUI_DATA_IN0_DATA_SHIFT)

/* Bitfield definition for register: DATA_IN1 */
/*
 * DATA (RO)
 *
 */
#define EUI_DATA_IN1_DATA_MASK (0xFFFFU)
#define EUI_DATA_IN1_DATA_SHIFT (0U)
#define EUI_DATA_IN1_DATA_GET(x) (((uint32_t)(x) & EUI_DATA_IN1_DATA_MASK) >> EUI_DATA_IN1_DATA_SHIFT)

/* Bitfield definition for register: DATA_IN2 */
/*
 * DATA (RO)
 *
 */
#define EUI_DATA_IN2_DATA_MASK (0xFFFFU)
#define EUI_DATA_IN2_DATA_SHIFT (0U)
#define EUI_DATA_IN2_DATA_GET(x) (((uint32_t)(x) & EUI_DATA_IN2_DATA_MASK) >> EUI_DATA_IN2_DATA_SHIFT)

/* Bitfield definition for register: DATA_IN3 */
/*
 * DATA (RO)
 *
 */
#define EUI_DATA_IN3_DATA_MASK (0xFFFFU)
#define EUI_DATA_IN3_DATA_SHIFT (0U)
#define EUI_DATA_IN3_DATA_GET(x) (((uint32_t)(x) & EUI_DATA_IN3_DATA_MASK) >> EUI_DATA_IN3_DATA_SHIFT)

/* Bitfield definition for register: DATA_IN4 */
/*
 * DATA (RO)
 *
 */
#define EUI_DATA_IN4_DATA_MASK (0xFFFFU)
#define EUI_DATA_IN4_DATA_SHIFT (0U)
#define EUI_DATA_IN4_DATA_GET(x) (((uint32_t)(x) & EUI_DATA_IN4_DATA_MASK) >> EUI_DATA_IN4_DATA_SHIFT)

/* Bitfield definition for register: DATA_IN5 */
/*
 * DATA (RO)
 *
 */
#define EUI_DATA_IN5_DATA_MASK (0xFFFFU)
#define EUI_DATA_IN5_DATA_SHIFT (0U)
#define EUI_DATA_IN5_DATA_GET(x) (((uint32_t)(x) & EUI_DATA_IN5_DATA_MASK) >> EUI_DATA_IN5_DATA_SHIFT)

/* Bitfield definition for register: DATA_IN6 */
/*
 * DATA (RO)
 *
 */
#define EUI_DATA_IN6_DATA_MASK (0xFFFFU)
#define EUI_DATA_IN6_DATA_SHIFT (0U)
#define EUI_DATA_IN6_DATA_GET(x) (((uint32_t)(x) & EUI_DATA_IN6_DATA_MASK) >> EUI_DATA_IN6_DATA_SHIFT)

/* Bitfield definition for register: DATA_IN7 */
/*
 * DATA (RO)
 *
 */
#define EUI_DATA_IN7_DATA_MASK (0xFFFFU)
#define EUI_DATA_IN7_DATA_SHIFT (0U)
#define EUI_DATA_IN7_DATA_GET(x) (((uint32_t)(x) & EUI_DATA_IN7_DATA_MASK) >> EUI_DATA_IN7_DATA_SHIFT)

/* Bitfield definition for register: DAB_CTRL */
/*
 * DB_CTRL (RW)
 *
 * 00:  output data B directly;
 * 01:  A&B;   10:  A|B;   11:  A^B
 */
#define EUI_DAB_CTRL_DB_CTRL_MASK (0xC0000000UL)
#define EUI_DAB_CTRL_DB_CTRL_SHIFT (30U)
#define EUI_DAB_CTRL_DB_CTRL_SET(x) (((uint32_t)(x) << EUI_DAB_CTRL_DB_CTRL_SHIFT) & EUI_DAB_CTRL_DB_CTRL_MASK)
#define EUI_DAB_CTRL_DB_CTRL_GET(x) (((uint32_t)(x) & EUI_DAB_CTRL_DB_CTRL_MASK) >> EUI_DAB_CTRL_DB_CTRL_SHIFT)

/*
 * LOOPAB (RW)
 *
 * display AB loop
 * display data A for prda, then B for prdB, then lopp AB;
 * then display C, D(loop CD), EF, GH, then back to AB
 * 0 for no loop, just display once
 */
#define EUI_DAB_CTRL_LOOPAB_MASK (0xFF0000UL)
#define EUI_DAB_CTRL_LOOPAB_SHIFT (16U)
#define EUI_DAB_CTRL_LOOPAB_SET(x) (((uint32_t)(x) << EUI_DAB_CTRL_LOOPAB_SHIFT) & EUI_DAB_CTRL_LOOPAB_MASK)
#define EUI_DAB_CTRL_LOOPAB_GET(x) (((uint32_t)(x) & EUI_DAB_CTRL_LOOPAB_MASK) >> EUI_DAB_CTRL_LOOPAB_SHIFT)

/*
 * PRDB (RW)
 *
 * display data B time(in unit of 16*disp_time), default 65ms(65536us)
 */
#define EUI_DAB_CTRL_PRDB_MASK (0xFF00U)
#define EUI_DAB_CTRL_PRDB_SHIFT (8U)
#define EUI_DAB_CTRL_PRDB_SET(x) (((uint32_t)(x) << EUI_DAB_CTRL_PRDB_SHIFT) & EUI_DAB_CTRL_PRDB_MASK)
#define EUI_DAB_CTRL_PRDB_GET(x) (((uint32_t)(x) & EUI_DAB_CTRL_PRDB_MASK) >> EUI_DAB_CTRL_PRDB_SHIFT)

/*
 * PRDA (RW)
 *
 * display data A time(in unit of 16*disp_time)
 * dab_ctrl.prda must be none-zero value, others can be set to 0 if no data
 */
#define EUI_DAB_CTRL_PRDA_MASK (0xFFU)
#define EUI_DAB_CTRL_PRDA_SHIFT (0U)
#define EUI_DAB_CTRL_PRDA_SET(x) (((uint32_t)(x) << EUI_DAB_CTRL_PRDA_SHIFT) & EUI_DAB_CTRL_PRDA_MASK)
#define EUI_DAB_CTRL_PRDA_GET(x) (((uint32_t)(x) & EUI_DAB_CTRL_PRDA_MASK) >> EUI_DAB_CTRL_PRDA_SHIFT)

/* Bitfield definition for register: DCD_CTRL */
/*
 * DD_CTRL (RW)
 *
 */
#define EUI_DCD_CTRL_DD_CTRL_MASK (0xC0000000UL)
#define EUI_DCD_CTRL_DD_CTRL_SHIFT (30U)
#define EUI_DCD_CTRL_DD_CTRL_SET(x) (((uint32_t)(x) << EUI_DCD_CTRL_DD_CTRL_SHIFT) & EUI_DCD_CTRL_DD_CTRL_MASK)
#define EUI_DCD_CTRL_DD_CTRL_GET(x) (((uint32_t)(x) & EUI_DCD_CTRL_DD_CTRL_MASK) >> EUI_DCD_CTRL_DD_CTRL_SHIFT)

/*
 * LOOPCD (RW)
 *
 */
#define EUI_DCD_CTRL_LOOPCD_MASK (0xFF0000UL)
#define EUI_DCD_CTRL_LOOPCD_SHIFT (16U)
#define EUI_DCD_CTRL_LOOPCD_SET(x) (((uint32_t)(x) << EUI_DCD_CTRL_LOOPCD_SHIFT) & EUI_DCD_CTRL_LOOPCD_MASK)
#define EUI_DCD_CTRL_LOOPCD_GET(x) (((uint32_t)(x) & EUI_DCD_CTRL_LOOPCD_MASK) >> EUI_DCD_CTRL_LOOPCD_SHIFT)

/*
 * PRDD (RW)
 *
 */
#define EUI_DCD_CTRL_PRDD_MASK (0xFF00U)
#define EUI_DCD_CTRL_PRDD_SHIFT (8U)
#define EUI_DCD_CTRL_PRDD_SET(x) (((uint32_t)(x) << EUI_DCD_CTRL_PRDD_SHIFT) & EUI_DCD_CTRL_PRDD_MASK)
#define EUI_DCD_CTRL_PRDD_GET(x) (((uint32_t)(x) & EUI_DCD_CTRL_PRDD_MASK) >> EUI_DCD_CTRL_PRDD_SHIFT)

