hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_eui_regs.h
/*
 * PRDC (RW)
 *
 */
#define EUI_DCD_CTRL_PRDC_MASK (0xFFU)
#define EUI_DCD_CTRL_PRDC_SHIFT (0U)
#define EUI_DCD_CTRL_PRDC_SET(x) (((uint32_t)(x) << EUI_DCD_CTRL_PRDC_SHIFT) & EUI_DCD_CTRL_PRDC_MASK)
#define EUI_DCD_CTRL_PRDC_GET(x) (((uint32_t)(x) & EUI_DCD_CTRL_PRDC_MASK) >> EUI_DCD_CTRL_PRDC_SHIFT)

/* Bitfield definition for register: DEF_CTRL */
/*
 * DF_CTRL (RW)
 *
 */
#define EUI_DEF_CTRL_DF_CTRL_MASK (0xC0000000UL)
#define EUI_DEF_CTRL_DF_CTRL_SHIFT (30U)
#define EUI_DEF_CTRL_DF_CTRL_SET(x) (((uint32_t)(x) << EUI_DEF_CTRL_DF_CTRL_SHIFT) & EUI_DEF_CTRL_DF_CTRL_MASK)
#define EUI_DEF_CTRL_DF_CTRL_GET(x) (((uint32_t)(x) & EUI_DEF_CTRL_DF_CTRL_MASK) >> EUI_DEF_CTRL_DF_CTRL_SHIFT)

/*
 * LOOPEF (RW)
 *
 */
#define EUI_DEF_CTRL_LOOPEF_MASK (0xFF0000UL)
#define EUI_DEF_CTRL_LOOPEF_SHIFT (16U)
#define EUI_DEF_CTRL_LOOPEF_SET(x) (((uint32_t)(x) << EUI_DEF_CTRL_LOOPEF_SHIFT) & EUI_DEF_CTRL_LOOPEF_MASK)
#define EUI_DEF_CTRL_LOOPEF_GET(x) (((uint32_t)(x) & EUI_DEF_CTRL_LOOPEF_MASK) >> EUI_DEF_CTRL_LOOPEF_SHIFT)

/*
 * PRDF (RW)
 *
 */
#define EUI_DEF_CTRL_PRDF_MASK (0xFF00U)
#define EUI_DEF_CTRL_PRDF_SHIFT (8U)
#define EUI_DEF_CTRL_PRDF_SET(x) (((uint32_t)(x) << EUI_DEF_CTRL_PRDF_SHIFT) & EUI_DEF_CTRL_PRDF_MASK)
#define EUI_DEF_CTRL_PRDF_GET(x) (((uint32_t)(x) & EUI_DEF_CTRL_PRDF_MASK) >> EUI_DEF_CTRL_PRDF_SHIFT)

/*
 * PRDE (RW)
 *
 */
#define EUI_DEF_CTRL_PRDE_MASK (0xFFU)
#define EUI_DEF_CTRL_PRDE_SHIFT (0U)
#define EUI_DEF_CTRL_PRDE_SET(x) (((uint32_t)(x) << EUI_DEF_CTRL_PRDE_SHIFT) & EUI_DEF_CTRL_PRDE_MASK)
#define EUI_DEF_CTRL_PRDE_GET(x) (((uint32_t)(x) & EUI_DEF_CTRL_PRDE_MASK) >> EUI_DEF_CTRL_PRDE_SHIFT)

/* Bitfield definition for register: DGH_CTRL */
/*
 * DH_CTRL (RW)
 *
 */
#define EUI_DGH_CTRL_DH_CTRL_MASK (0xC0000000UL)
#define EUI_DGH_CTRL_DH_CTRL_SHIFT (30U)
#define EUI_DGH_CTRL_DH_CTRL_SET(x) (((uint32_t)(x) << EUI_DGH_CTRL_DH_CTRL_SHIFT) & EUI_DGH_CTRL_DH_CTRL_MASK)
#define EUI_DGH_CTRL_DH_CTRL_GET(x) (((uint32_t)(x) & EUI_DGH_CTRL_DH_CTRL_MASK) >> EUI_DGH_CTRL_DH_CTRL_SHIFT)

/*
 * LOOPGH (RW)
 *
 */
#define EUI_DGH_CTRL_LOOPGH_MASK (0xFF0000UL)
#define EUI_DGH_CTRL_LOOPGH_SHIFT (16U)
#define EUI_DGH_CTRL_LOOPGH_SET(x) (((uint32_t)(x) << EUI_DGH_CTRL_LOOPGH_SHIFT) & EUI_DGH_CTRL_LOOPGH_MASK)
#define EUI_DGH_CTRL_LOOPGH_GET(x) (((uint32_t)(x) & EUI_DGH_CTRL_LOOPGH_MASK) >> EUI_DGH_CTRL_LOOPGH_SHIFT)

/*
 * PRDH (RW)
 *
 */
#define EUI_DGH_CTRL_PRDH_MASK (0xFF00U)
#define EUI_DGH_CTRL_PRDH_SHIFT (8U)
#define EUI_DGH_CTRL_PRDH_SET(x) (((uint32_t)(x) << EUI_DGH_CTRL_PRDH_SHIFT) & EUI_DGH_CTRL_PRDH_MASK)
#define EUI_DGH_CTRL_PRDH_GET(x) (((uint32_t)(x) & EUI_DGH_CTRL_PRDH_MASK) >> EUI_DGH_CTRL_PRDH_SHIFT)

/*
 * PRDG (RW)
 *
 */
#define EUI_DGH_CTRL_PRDG_MASK (0xFFU)
#define EUI_DGH_CTRL_PRDG_SHIFT (0U)
#define EUI_DGH_CTRL_PRDG_SET(x) (((uint32_t)(x) << EUI_DGH_CTRL_PRDG_SHIFT) & EUI_DGH_CTRL_PRDG_MASK)
#define EUI_DGH_CTRL_PRDG_GET(x) (((uint32_t)(x) & EUI_DGH_CTRL_PRDG_MASK) >> EUI_DGH_CTRL_PRDG_SHIFT)

/* Bitfield definition for register: DA_00 */
/*
 * DATA (RW)
 *
 */
#define EUI_DA_00_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DA_00_DATA_SHIFT (0U)
#define EUI_DA_00_DATA_SET(x) (((uint32_t)(x) << EUI_DA_00_DATA_SHIFT) & EUI_DA_00_DATA_MASK)
#define EUI_DA_00_DATA_GET(x) (((uint32_t)(x) & EUI_DA_00_DATA_MASK) >> EUI_DA_00_DATA_SHIFT)

/* Bitfield definition for register: DA_01 */
/*
 * DATA (RW)
 *
 */
#define EUI_DA_01_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DA_01_DATA_SHIFT (0U)
#define EUI_DA_01_DATA_SET(x) (((uint32_t)(x) << EUI_DA_01_DATA_SHIFT) & EUI_DA_01_DATA_MASK)
#define EUI_DA_01_DATA_GET(x) (((uint32_t)(x) & EUI_DA_01_DATA_MASK) >> EUI_DA_01_DATA_SHIFT)

/* Bitfield definition for register: DB_00 */
/*
 * DATA (RW)
 *
 */
#define EUI_DB_00_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DB_00_DATA_SHIFT (0U)
#define EUI_DB_00_DATA_SET(x) (((uint32_t)(x) << EUI_DB_00_DATA_SHIFT) & EUI_DB_00_DATA_MASK)
#define EUI_DB_00_DATA_GET(x) (((uint32_t)(x) & EUI_DB_00_DATA_MASK) >> EUI_DB_00_DATA_SHIFT)

/* Bitfield definition for register: DB_01 */
/*
 * DATA (RW)
 *
 */
#define EUI_DB_01_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DB_01_DATA_SHIFT (0U)
#define EUI_DB_01_DATA_SET(x) (((uint32_t)(x) << EUI_DB_01_DATA_SHIFT) & EUI_DB_01_DATA_MASK)
#define EUI_DB_01_DATA_GET(x) (((uint32_t)(x) & EUI_DB_01_DATA_MASK) >> EUI_DB_01_DATA_SHIFT)

/* Bitfield definition for register: DC_00 */
/*
 * DATA (RW)
 *
 */
#define EUI_DC_00_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DC_00_DATA_SHIFT (0U)
#define EUI_DC_00_DATA_SET(x) (((uint32_t)(x) << EUI_DC_00_DATA_SHIFT) & EUI_DC_00_DATA_MASK)
#define EUI_DC_00_DATA_GET(x) (((uint32_t)(x) & EUI_DC_00_DATA_MASK) >> EUI_DC_00_DATA_SHIFT)

/* Bitfield definition for register: DC_01 */
/*
 * DATA (RW)
 *
 */
#define EUI_DC_01_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DC_01_DATA_SHIFT (0U)
#define EUI_DC_01_DATA_SET(x) (((uint32_t)(x) << EUI_DC_01_DATA_SHIFT) & EUI_DC_01_DATA_MASK)
#define EUI_DC_01_DATA_GET(x) (((uint32_t)(x) & EUI_DC_01_DATA_MASK) >> EUI_DC_01_DATA_SHIFT)

/* Bitfield definition for register: DD_00 */
/*
 * DATA (RW)
 *
 */
#define EUI_DD_00_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DD_00_DATA_SHIFT (0U)
#define EUI_DD_00_DATA_SET(x) (((uint32_t)(x) << EUI_DD_00_DATA_SHIFT) & EUI_DD_00_DATA_MASK)
#define EUI_DD_00_DATA_GET(x) (((uint32_t)(x) & EUI_DD_00_DATA_MASK) >> EUI_DD_00_DATA_SHIFT)

/* Bitfield definition for register: DD_01 */
/*
 * DATA (RW)
 *
 */
#define EUI_DD_01_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DD_01_DATA_SHIFT (0U)
#define EUI_DD_01_DATA_SET(x) (((uint32_t)(x) << EUI_DD_01_DATA_SHIFT) & EUI_DD_01_DATA_MASK)
#define EUI_DD_01_DATA_GET(x) (((uint32_t)(x) & EUI_DD_01_DATA_MASK) >> EUI_DD_01_DATA_SHIFT)

/* Bitfield definition for register: DE_00 */
/*
 * DATA (RW)
 *
 */
#define EUI_DE_00_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DE_00_DATA_SHIFT (0U)
#define EUI_DE_00_DATA_SET(x) (((uint32_t)(x) << EUI_DE_00_DATA_SHIFT) & EUI_DE_00_DATA_MASK)
#define EUI_DE_00_DATA_GET(x) (((uint32_t)(x) & EUI_DE_00_DATA_MASK) >> EUI_DE_00_DATA_SHIFT)

/* Bitfield definition for register: DE_01 */
/*
 * DATA (RW)
 *
 */
#define EUI_DE_01_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DE_01_DATA_SHIFT (0U)
#define EUI_DE_01_DATA_SET(x) (((uint32_t)(x) << EUI_DE_01_DATA_SHIFT) & EUI_DE_01_DATA_MASK)
#define EUI_DE_01_DATA_GET(x) (((uint32_t)(x) & EUI_DE_01_DATA_MASK) >> EUI_DE_01_DATA_SHIFT)

/* Bitfield definition for register: DF_00 */
/*
 * DATA (RW)
 *
 */
#define EUI_DF_00_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DF_00_DATA_SHIFT (0U)
#define EUI_DF_00_DATA_SET(x) (((uint32_t)(x) << EUI_DF_00_DATA_SHIFT) & EUI_DF_00_DATA_MASK)
#define EUI_DF_00_DATA_GET(x) (((uint32_t)(x) & EUI_DF_00_DATA_MASK) >> EUI_DF_00_DATA_SHIFT)

/* Bitfield definition for register: DF_01 */
/*
 * DATA (RW)
 *
 */
#define EUI_DF_01_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DF_01_DATA_SHIFT (0U)
#define EUI_DF_01_DATA_SET(x) (((uint32_t)(x) << EUI_DF_01_DATA_SHIFT) & EUI_DF_01_DATA_MASK)
#define EUI_DF_01_DATA_GET(x) (((uint32_t)(x) & EUI_DF_01_DATA_MASK) >> EUI_DF_01_DATA_SHIFT)

/* Bitfield definition for register: DG_00 */
/*
 * DATA (RW)
 *
 */
#define EUI_DG_00_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DG_00_DATA_SHIFT (0U)
#define EUI_DG_00_DATA_SET(x) (((uint32_t)(x) << EUI_DG_00_DATA_SHIFT) & EUI_DG_00_DATA_MASK)
#define EUI_DG_00_DATA_GET(x) (((uint32_t)(x) & EUI_DG_00_DATA_MASK) >> EUI_DG_00_DATA_SHIFT)

/* Bitfield definition for register: DG_01 */
/*
 * DATA (RW)
 *
 */
#define EUI_DG_01_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DG_01_DATA_SHIFT (0U)
#define EUI_DG_01_DATA_SET(x) (((uint32_t)(x) << EUI_DG_01_DATA_SHIFT) & EUI_DG_01_DATA_MASK)
#define EUI_DG_01_DATA_GET(x) (((uint32_t)(x) & EUI_DG_01_DATA_MASK) >> EUI_DG_01_DATA_SHIFT)

/* Bitfield definition for register: DH_00 */
/*
 * DATA (RW)
 *
 */
#define EUI_DH_00_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DH_00_DATA_SHIFT (0U)
#define EUI_DH_00_DATA_SET(x) (((uint32_t)(x) << EUI_DH_00_DATA_SHIFT) & EUI_DH_00_DATA_MASK)
#define EUI_DH_00_DATA_GET(x) (((uint32_t)(x) & EUI_DH_00_DATA_MASK) >> EUI_DH_00_DATA_SHIFT)

/* Bitfield definition for register: DH_01 */
/*
 * DATA (RW)
 *
 */
#define EUI_DH_01_DATA_MASK (0xFFFFFFFFUL)
#define EUI_DH_01_DATA_SHIFT (0U)
#define EUI_DH_01_DATA_SET(x) (((uint32_t)(x) << EUI_DH_01_DATA_SHIFT) & EUI_DH_01_DATA_MASK)
#define EUI_DH_01_DATA_GET(x) (((uint32_t)(x) & EUI_DH_01_DATA_MASK) >> EUI_DH_01_DATA_SHIFT)




#endif /* HPM_EUI_H */
